app/views/articles/_article.html.erb

      <div >
        <% if article.tags.any? %>
---
SELECT  1 AS one FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ? LIMIT ?  [["article_id", 3], ["LIMIT", 1]]

      </div>
      <% if article.categories.any? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 4], ["LIMIT", 1]]