app/views/articles/_form.html.erb

SELECT "tags".* FROM "tags"
---
        <div class="col-sm-offset-1 col-sm-4">
          <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name do |cb| %>

SELECT "categories".* FROM "categories"
---
      <div class="col-sm-offset-4 col-sm-8">
        <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>