app/views/articles/show.html.erb

SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 12], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 12]]
---
      </div>
      <% if @article.categories.any? %>

SELECT  1 AS one FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ? LIMIT ?  [["article_id", 2], ["LIMIT", 1]]
---
      <%end%>
      <% if @article.tags.any? %>