app/views/tags/index.html.erb

            </li>
            <li><small><%= pluralize(tag.articles.count, "article") %></small></li>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_tags" ON "articles"."id" = "article_tags"."article_id" WHERE "article_tags"."tag_id" = ?  [["tag_id", 1]]