app/controllers/articles_controller.rb

  def create
    #article_params[:data] = article_params[:data].read
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "hello how are you my friend"], ["description", "this is just a test man"], ["created_at", "2017-11-24 07:34:41.463445"], ["updated_at", "2017-11-24 07:34:41.463445"], ["user_id", 3]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "url" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["url", "https://api.qanvast.com/image/278947_a566687e2b/standard) no-repeat center center/cover;width:100%;height:100%"], ["updated_at", "2018-06-03 10:53:04.381666"], ["id", 2]]