app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tags"
---
  def index
    @tags = Tag.paginate(page: params[:page], per_page: 5)

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "new tags"], ["created_at", "2018-05-31 10:10:35.978803"], ["updated_at", "2018-05-31 10:10:35.978803"]]
---
  def create
    @tag = Tag.create(tag_params)

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_tags" ON "articles"."id" = "article_tags"."article_id" WHERE "article_tags"."tag_id" = ? LIMIT ? OFFSET ?  [["tag_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "tags".* FROM "tags"
SELECT COUNT(*) FROM "articles" INNER JOIN "article_tags" ON "articles"."id" = "article_tags"."article_id" WHERE "article_tags"."tag_id" = ?  [["tag_id", 1]]
---
  def show
    @tag = Tag.find(params[:id])
    @tag_articles = @tag.articles.paginate(page: params[:page], per_page: 5)

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @tag = Tag.find(params[:id])

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "new tagss"], ["updated_at", "2018-05-31 10:12:31.947793"], ["id", 1]]
---
  def update
    @tag = Tag.find(params[:id])
    if @tag.update(tag_params)