app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "anasyo101@gmail.com"], ["password_digest", "$2a$10$/KN6tFIyR6hlfAEPCfm52O3hZkWPuqR63/33UlME5xna85sNtXZe6"], ["updated_at", "2017-11-24 10:26:03.620498"], ["id", 4]]

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]