app/views/layouts/_navigation.html.erb

                <li><%= link_to  "Link to All Categories", categories_path %></li>
                <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"

                <li><%= link_to  "Link to All Tag", tags_path %></li>
                <% Tag.all.each do |tag| %>
---
SELECT "tags".* FROM "tags"